module.exports = {
  semi: true, // Отключить точку с запятой в конце строки
  singleQuote: true, // Использовать одинарные кавычки вместо двойных
  trailingComma: 'all', // Использовать запятые в конце всех объектов и массивов
  printWidth: 120, // Максимальная ширина строки
  tabWidth: 2, // Ширина табуляции — 2 пробела
  useTabs: false, // Использовать пробелы вместо табуляций
  bracketSpacing: true, // Пробелы внутри фигурных скобок: { foo: bar }
  endOfLine: 'crlf', // Устанавливаем 'lf' как символ конца строки
};
